interface LineColorType {
  [key: string]: string;
}

// 디자인쌤이 변경 요청 할 수 있어서 남겨둡니다~
// export const line_color: LineColorType = {
//   '1호선': '#0052A4',
//   '2호선': '#00A84D',
//   '3호선': '#EF7C1C',
//   '4호선': '#00A5DE',
//   '5호선': '#996CAC',
//   '6호선': '#CD7C2F',
//   '7호선': '#747F00',
//   '8호선': '#E6186C',
//   '9호선': '#BDB092',
//   경의중앙선: '#77C4A3',
//   수인분당선: '#F5A200',
//   신분당선: '#D4003B',
//   우이신설선: '#B0CE18',
//   경춘선: '#28D678',
// };

export const line_color: LineColorType = {
  '1호선': '#0032A0',
  '2호선': '#00B140',
  '3호선': '#FC4C02',
  '4호선': '#00A9E0',
  '5호선': '#A05EB5',
  '6호선': '#A9431E',
  '7호선': '#67823A',
  '8호선': '#E31C79',
  '9호선': '#8C8279',
  경의중앙선: '#74c7a6',
  서해선: '#96D457',
  수인분당선: '#ff8c00',
  신분당선: '#c82127',
  인천선: '#0080ff',
  인천2호선: '#F5A251',
  우이신설선: '#B3C73E',
  경춘선: '#5DA9AE',
  경강선: '#0054a6',
  공항철도: '#3681b7',
  에버라인: '#95C569',
  신림선: '#6E88C5',
  ITX: '#52AB57',
  의정부경전철: '#E0A243',
  김포골드: '#B69745',
};
